src/cf/src/AccumulationRegisters/ВзаиморасчётыСПокупателямиНалоговый/ВзаиморасчётыСПокупателямиНалоговый.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчётыСПокупателямиНалоговый</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийНалоговые</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументДвижения</name>
    <type>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.ВозвратОтПокупателяНалоговый</types>
      <types>DocumentRef.НалоговаяНакладная</types>
      <types>DocumentRef.ВозвратПоставщикуНалоговый</types>
      <types>DocumentRef.НалоговаяНакладнаяПокупка</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРасчётов</name>
    <type>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.ВозвратОтПокупателяНалоговый</types>
      <types>DocumentRef.НалоговаяНакладная</types>
      <types>DocumentRef.ВозвратПоставщикуНалоговый</types>
      <types>DocumentRef.НалоговаяНакладнаяПокупка</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/AccumulationRegisters/ТоварыВПереработке/ТоварыВПереработке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыВПереработке</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <comment>Переработчик, у которого находятся товары</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ПриходныйДокументПартии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПартии</name>
    <comment>Реквизит для ускорения выборки по FIFO</comment>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПередачаВПереработку</name>
    <type>
      <types>DocumentRef.ПередачаВПереработку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <posting>Allow</posting>
  <registerRecords>AccumulationRegister.ПотребностиПроизводства</registerRecords>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.КоммерческоеПредложение</types>
    </type>
  </attributes>
  <attributes>
    <name>ECommerce</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Доставлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокументаЭлектронногоОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказСWEBСайта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокументаЭлектронногоОбмена</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МенеджерПодтвердилПроверилОстаток</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийЗаказаПокупателя</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаSKU</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>DefinedType.ПроцентСкидки</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаНаЦену</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Техкарта</name>
      <type>
        <types>DocumentRef.ТехнологическаяКарта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧМатериалы</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтрокиПродукции</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтрокиРодителя</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЗаЕдиницу</name>
      <type>
        <types>DefinedType.НормаРасхода</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Documents/ОприходованиеТоваров/ОприходованиеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОприходованиеТоваров</name>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВНаличии</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыСкладскихОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>Станок</name>
    <type>
      <types>CatalogRef.ПроизводственноеОборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПересчётТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/CommonModules/ОбновлениеДанныхВызовСервера/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Одноразовые заполнения данных после обновления конфигурации.
//
// Шаги нумеруются по порядку имён в ИменаШаговЗаполнения, номер последнего
// выполненного хранится в константе НомерВыполненногоЗаполненияДанных.
// Невыполненные шаги запускаются при начале работы системы под пользователем
// с правом администрирования; каждый шаг идемпотентен и пишет итог в журнал
// регистрации.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Выполняет невыполненные одноразовые заполнения данных.
// Вызывается при начале работы системы; для пользователей без права
// администрирования и при выполненных шагах ничего не делает.
//
Процедура ВыполнитьЗаполненияДанных() Экспорт

	Если Не ПравоДоступа("Администрирование", Метаданные) Тогда
		Возврат;
	КонецЕсли;

	ИменаШагов = ИменаШаговЗаполнения();
	Если Константы.НомерВыполненногоЗаполненияДанных.Получить() >= ИменаШагов.Количество() Тогда
		Возврат;
	КонецЕсли;

	МоментОбновления = ТекущаяДатаСеанса();

	Пока Истина Цикл

		ШагВыполнен = Ложь;
		НачатьТранзакцию();
		Попытка
			Блокировка = Новый БлокировкаДанных;
			Блокировка.Добавить("Константа.НомерВыполненногоЗаполненияДанных");
			Блокировка.Заблокировать();

			НомерВыполненного = Константы.НомерВыполненногоЗаполненияДанных.Получить();
			Если НомерВыполненного < ИменаШагов.Количество() Тогда
				ВыполнитьШагЗаполнения(ИменаШагов[НомерВыполненного], МоментОбновления);
				Константы.НомерВыполненногоЗаполненияДанных.Установить(НомерВыполненного + 1);
				ШагВыполнен = Истина;
			КонецЕсли;
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			// Шаг упал или константу держит другой сеанс - не мешаем входу в систему,
			// попытка повторится при следующем входе администратора.
			// ПодробноеПредставлениеОшибки устарела, но МенеджерОбработкиОшибок в 8.5.1 отсутствует
			ЗаписьЖурналаРегистрации(ИмяСобытияЖурнала(), УровеньЖурналаРегистрации.Ошибка, , ,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			Прервать;
		КонецПопытки;

		Если Не ШагВыполнен Тогда
			Прервать;
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Имена шагов заполнения в порядке выполнения.
// Порядок определяет нумерацию, новые шаги добавлять только в конец.
//
// Возвращаемое значение:
//  Массив из Строка - имена шагов
//
Функция ИменаШаговЗаполнения()

	Имена = Новый Массив;
	Имена.Добавить("ЦенаВключаетНДС");
	Имена.Добавить("ОбъектРасчётовНалоговыхРегистров");
	Имена.Добавить("ПроизводственныеСтатусыЗаказов");
	Имена.Добавить("ЗаказВДвиженияхПереработки");
	Возврат Имена;

КонецФункции

// Выполняет один шаг заполнения данных.
//
// Параметры:
//  ИмяШага          - Строка - имя шага из ИменаШаговЗаполнения
//  МоментОбновления - Дата   - момент запуска заполнений
//
Процедура ВыполнитьШагЗаполнения(ИмяШага, МоментОбновления)

	Если ИмяШага = "ЦенаВключаетНДС" Тогда
		ЗаполнитьПризнакЦенаВключаетНДС(МоментОбновления);
	ИначеЕсли ИмяШага = "ОбъектРасчётовНалоговыхРегистров" Тогда
		ЗаполнитьОбъектРасчётовНалоговыхРегистров();
	ИначеЕсли ИмяШага = "ПроизводственныеСтатусыЗаказов" Тогда
		ЗаполнитьПроизводственныеСтатусыЗаказов();
	ИначеЕсли ИмяШага = "ЗаказВДвиженияхПереработки" Тогда
		ЗаполнитьЗаказВДвиженияхПереработки();
	Иначе
		ШаблонСообщения = НСтр("ru = 'Неизвестный шаг заполнения данных: %1';
			|fr = 'Étape inconnue du remplissage de données : %1';
			|en = 'Unknown data filling step: %1';
			|es = 'Paso desconocido del relleno de datos: %1'");
		ВызватьИсключение СтрШаблон(ШаблонСообщения, ИмяШага);
	КонецЕсли;

КонецПроцедуры

// Возвращаемое значение:
//  Строка - имя события журнала регистрации
//
Функция ИмяСобытияЖурнала()

	Возврат НСтр("ru = 'Обновление данных'; fr = 'Mise à jour des données'; en = 'Data update'; es = 'Actualización de datos'");

КонецФункции

// Выполняет шаг ЦенаВключаетНДС.
//
// Параметры:
//  МоментОбновления - Дата - обновляются только документы с датой до этого момента
//
Процедура ЗаполнитьПризнакЦенаВключаетНДС(МоментОбновления)

	// История продаж велась в ценах с НДС; после добавления реквизита ЦенаВключаетНДС
	// (волна 9) у существующих документов он Ложь. Признак проставляется прямой записью
	// реквизита, без перепроведения (wave9-check.md, п. 2).
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Т.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаказПокупателя КАК Т
	|ГДЕ
	|	НЕ Т.ЦенаВключаетНДС
	|	И Т.Дата < &МоментОбновления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК Т
	|ГДЕ
	|	НЕ Т.ЦенаВключаетНДС
	|	И Т.Дата < &МоментОбновления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Ссылка
	|ИЗ
	|	Документ.НалоговаяНакладная КАК Т
	|ГДЕ
	|	НЕ Т.ЦенаВключаетНДС
	|	И Т.Дата < &МоментОбновления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Ссылка
	|ИЗ
	|	Документ.ВозвратОтПокупателя КАК Т
	|ГДЕ
	|	НЕ Т.ЦенаВключаетНДС
	|	И Т.Дата < &МоментОбновления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Ссылка
	|ИЗ
	|	Документ.ВозвратОтПокупателяНалоговый КАК Т
	|ГДЕ
	|	НЕ Т.ЦенаВключаетНДС
	|	И Т.Дата < &МоментОбновления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Ссылка
	|ИЗ
	|	Документ.ОприходованиеТоваров КАК Т
	|ГДЕ
	|	НЕ Т.ЦенаВключаетНДС
	|	И Т.Дата < &МоментОбновления";
	Запрос.УстановитьПараметр("МоментОбновления", МоментОбновления);

	КоличествоОбновлено = 0;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокОбъект.ЦенаВключаетНДС = Истина;
		ДокОбъект.ОбменДанными.Загрузка = Истина;
		ДокОбъект.Записать();
		КоличествоОбновлено = КоличествоОбновлено + 1;
	КонецЦикла;

	ШаблонСообщения = НСтр("ru = 'Заполнение ЦенаВключаетНДС: обновлено документов: %1';
		|fr = 'Remplissage de PrixTTC : documents mis à jour : %1';
		|en = 'Filling of PriceIncludesVAT: documents updated: %1';
		|es = 'Relleno de PrecioIncluyeIVA: documentos actualizados: %1'");
	ЗаписьЖурналаРегистрации(ИмяСобытияЖурнала(), УровеньЖурналаРегистрации.Информация, , ,
		СтрШаблон(ШаблонСообщения, КоличествоОбновлено));

КонецПроцедуры

Процедура ЗаполнитьОбъектРасчётовНалоговыхРегистров()

	// Измерение ОбъектРасчётов налоговых регистров взаиморасчётов (волна 10) у
	// исторических движений пусто. Заполняется значением реквизита ДокументДвижения
	// наборами записей, без перепроведения (wave10-check.md, п. 3.3).
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.ВзаиморасчётыСПокупателямиНалоговый КАК Т
	|ГДЕ
	|	Т.ОбъектРасчётов = НЕОПРЕДЕЛЕНО
	|	И Т.ДокументДвижения <> НЕОПРЕДЕЛЕНО";
	ЗаполнитьОбъектРасчётовРегистра("ВзаиморасчётыСПокупателямиНалоговый", Запрос);

	// Во втором регистре латинская "c" в имени - как в метаданных.
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "СПокупателями", "СПоcтавщиками");
	ЗаполнитьОбъектРасчётовРегистра("ВзаиморасчётыСПоcтавщикамиНалоговый", Запрос);

КонецПроцедуры

// Заполняет ОбъектРасчётов в одном налоговом регистре взаиморасчётов.
//
// Параметры:
//  ИмяРегистра - Строка - имя регистра накопления
//  Запрос      - Запрос - готовый запрос регистраторов с пустым ОбъектРасчётов
//
Процедура ЗаполнитьОбъектРасчётовРегистра(ИмяРегистра, Запрос)

	КоличествоЗаписей = 0;
	КоличествоРегистраторов = 0;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыНакопления[ИмяРегистра].СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
		НаборЗаписей.Прочитать();
		ЕстьИзменения = Ложь;
		Для Каждого Запись Из НаборЗаписей Цикл
			Если Запись.ОбъектРасчётов = Неопределено И Запись.ДокументДвижения <> Неопределено Тогда
				Запись.ОбъектРасчётов = Запись.ДокументДвижения;
				ЕстьИзменения = Истина;
				КоличествоЗаписей = КоличествоЗаписей + 1;
			КонецЕсли;
		КонецЦикла;
		Если ЕстьИзменения Тогда
			НаборЗаписей.ОбменДанными.Загрузка = Истина;
			НаборЗаписей.Записать();
			КоличествоРегистраторов = КоличествоРегистраторов + 1;
		КонецЕсли;
	КонецЦикла;

	ШаблонСообщения = НСтр("ru = 'Заполнение ОбъектРасчётов регистра %1: обновлено записей: %2 (документов: %3)';
		|fr = 'Remplissage de ObjetDeRèglement du registre %1 : enregistrements mis à jour : %2 (documents : %3)';
		|en = 'Filling of SettlementObject of register %1: records updated: %2 (documents: %3)';
		|es = 'Relleno de ObjetoDeLiquidación del registro %1: registros actualizados: %2 (documentos: %3)'");
	ЗаписьЖурналаРегистрации(ИмяСобытияЖурнала(), УровеньЖурналаРегистрации.Информация, , ,
		СтрШаблон(ШаблонСообщения, ИмяРегистра, КоличествоЗаписей, КоличествоРегистраторов));

КонецПроцедуры

Процедура ЗаполнитьПроизводственныеСтатусыЗаказов()

	// Производственные статусы заказов (волна 12) появились после ввода документов
	// производственного контура. По каждому заказу, к которому привязаны проведённые
	// производственные документы, статус пересчитывается по последнему связанному
	// документу; запись в историю добавляется, только если статус отличается.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Основание КАК Основание
	|ИЗ
	|	Документ.ПередачаВПереработку КАК Т
	|ГДЕ
	|	Т.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Основание
	|ИЗ
	|	Документ.ПоступлениеИзПереработки КАК Т
	|ГДЕ
	|	Т.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Основание
	|ИЗ
	|	Документ.ВыпускПродукции КАК Т
	|ГДЕ
	|	Т.Проведен";

	КоличествоЗаказов = 0;
	ОбработанныеЗаказы = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Заказ = РаботаСДокументами.ПолучитьДокументРодительПоТипу(
			Тип("ДокументСсылка.ЗаказПокупателя"), Выборка.Основание);
		Если ЗначениеЗаполнено(Заказ) И ОбработанныеЗаказы[Заказ] = Неопределено Тогда
			ОбработанныеЗаказы.Вставить(Заказ, Истина);
			РаботаСДокументами.ОбновитьСтатусЗаказаПоСвязанным(Заказ);
			КоличествоЗаказов = КоличествоЗаказов + 1;
		КонецЕсли;
	КонецЦикла;

	ШаблонСообщения = НСтр("ru = 'Заполнение производственных статусов: пересчитано заказов: %1';
		|fr = 'Remplissage des statuts de production : commandes recalculées : %1';
		|en = 'Filling of production statuses: orders recalculated: %1';
		|es = 'Relleno de los estados de producción: pedidos recalculados: %1'");
	ЗаписьЖурналаРегистрации(ИмяСобытияЖурнала(), УровеньЖурналаРегистрации.Информация, , ,
		СтрШаблон(ШаблонСообщения, КоличествоЗаказов));

КонецПроцедуры

Процедура ЗаполнитьЗаказВДвиженияхПереработки()

	// Измерение ЗаказПокупателя регистра ТоварыВПереработке (волна 12) у исторических
	// движений пусто. Заполняется по цепочке оснований регистратора наборами записей,
	// без перепроведения.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.ТоварыВПереработке КАК Т
	|ГДЕ
	|	Т.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)";

	КоличествоРегистраторов = 0;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Заказ = РаботаСДокументами.ПолучитьДокументРодительПоТипу(
			Тип("ДокументСсылка.ЗаказПокупателя"), Выборка.Регистратор.Основание);
		Если Не ЗначениеЗаполнено(Заказ) Тогда
			Продолжить;
		КонецЕсли;
		НаборЗаписей = РегистрыНакопления.ТоварыВПереработке.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
		НаборЗаписей.Прочитать();
		ЕстьИзменения = Ложь;
		Для Каждого Запись Из НаборЗаписей Цикл
			Если Не ЗначениеЗаполнено(Запись.ЗаказПокупателя) Тогда
				Запись.ЗаказПокупателя = Заказ;
				ЕстьИзменения = Истина;
			КонецЕсли;
		КонецЦикла;
		Если ЕстьИзменения Тогда
			НаборЗаписей.ОбменДанными.Загрузка = Истина;
			НаборЗаписей.Записать();
			КоличествоРегистраторов = КоличествоРегистраторов + 1;
		КонецЕсли;
	КонецЦикла;

	ШаблонСообщения = НСтр("ru = 'Заполнение заказа в движениях переработки: обновлено документов: %1';
		|fr = 'Remplissage de la commande dans les mouvements de sous-traitance : documents mis à jour : %1';
		|en = 'Filling of the order in processing movements: documents updated: %1';
		|es = 'Relleno del pedido en los movimientos de procesamiento: documentos actualizados: %1'");
	ЗаписьЖурналаРегистрации(ИмяСобытияЖурнала(), УровеньЖурналаРегистрации.Информация, , ,
		СтрШаблон(ШаблонСообщения, КоличествоРегистраторов));

КонецПроцедуры

#КонецОбласти
